Autodesk.Revit.DB.ExternalResourceLoadContent.SetIsDownloaded(System.Boolean)
Since:
2015

Autodesk.Revit.DB.ExternalResourceLoadContent.Sync(Autodesk.Revit.DB.ExternalResourceLoadContent)
Syncs version and loadStatus with a given ExternalResourceLoadContent.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceLoadContent.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternalResourceLoadContent.LoadStatus
A value to indicate the status of an external resource load operation.  IExternalResourceServers
should set this in the LoadResource() method.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The ExternalResourceLoadContent does not contain all the necessary
data. To see the requirements for this particular resource type,
please see the documentation for the specific subclass of
ExternalResourceLoadContent.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.ExternalResourceLoadContent.Version
The version of the external data that the server is providing in this object.
Remarks:
When its LoadResource() method is invoked, an IExternalResourceServer can
indicate the version of the data that it is providing to Revit by setting
this property.  Doing so will improve performance, because Revit will use
the version information to avoid unnecessary reloads.
See Autodesk.Revit.DB.IExternalResourceServer.GetResourceVersionStatus(Autodesk.Revit.DB.ExternalResourceReference).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.ExternalResourceLoadContent
This class contains the actual content data and other results of an external resource load operation that are
returned by an IExternalResourceServer to Revit.
Remarks:
When Revit calls the LoadResource method for an IExternalResourceServer, Revit will provide an object that is a
sub-class of ExternalResourceLoadContent.  The IExternalResourceServer will use this object to return the content
Revit should use for the external resource.  The server can also add information about any errors that occurred
during the load operation.  This error information will be stored by Revit and later passed to the
associated IExternalResourceUIServer (if any) that designates the IExternalResourceServer as its "DBServer"
(see the IExternalResourceUIServer.GetDBServerId() method).  The IExternalResourceUIServer can then generate
any UI that is required for handling the errors that occurred.
Note that since different kinds of external resources are expected to return different kinds of data to Revit,
a number of ExternalResourceLoadContent sub-classes have been created to handle the data for specific ExternalResourceTypes.
This base class contains only a string to indicate the version of the resource data that is being supplied
by the server and a status variable to indicate the outcome of a load operation.  Revit will always
provide the server with an instance of the appropriate sub-class of ExternalResourceLoadContent, with internal
data that are relevant to the particular ExternalResourceType that is being loaded.
Since:
2015